In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('DataScience_salaries_2024.csv')

In [3]:
#for top 5 jobs

In [14]:
jobs=data.groupby('job_title')

In [15]:
jobs.get_group('Data Scientist')

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L
2,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
7,2022,EN,FT,Data Scientist,6600000,HUF,17684,HU,100,HU,M
15,2022,MI,FT,Data Scientist,4200000,INR,53416,IN,100,ID,L
17,2021,SE,FT,Data Scientist,4000000,INR,54094,IN,100,IN,L
...,...,...,...,...,...,...,...,...,...,...,...
14784,2023,EN,FT,Data Scientist,24000,USD,24000,US,100,US,M
14804,2021,MI,FT,Data Scientist,21600,EUR,25532,RS,100,DE,S
14822,2020,EN,PT,Data Scientist,19000,EUR,21669,IT,50,IT,S
14824,2023,EN,FT,Data Scientist,18000,EUR,19434,GR,100,GR,L
14830,2023,EN,FT,Data Scientist,16000,USD,16000,EC,100,EC,L

In [16]:
jobs.get_group('Data Scientist').shape

(3015, 11)

In [19]:
jobs['remote_ratio'].sum().sort_values(ascending=False)

job_title
Data Engineer                 107750
Data Scientist                103450
Data Analyst                   79900
Machine Learning Engineer      42700
Analytics Engineer             18550
                               ...
Data Science Analyst               0
Applied Research Scientist         0
Big Data Developer                 0
Data Visualization Analyst         0
Data Integration Developer         0
Name: remote_ratio, Length: 153, dtype: int64

In [20]:
jobs['remote_ratio'].sum().sort_values(ascending=False).head(5)

job_title
Data Engineer                107750
Data Scientist               103450
Data Analyst                  79900
Machine Learning Engineer     42700
Analytics Engineer            18550
Name: remote_ratio, dtype: int64

In [21]:
jobs['remote_ratio'].sum().sort_values(ascending=False).head(10)

job_title
Data Engineer                     107750
Data Scientist                    103450
Data Analyst                       79900
Machine Learning Engineer          42700
Analytics Engineer                 18550
Data Architect                     16700
Applied Scientist                  10550
Research Scientist                  8500
ML Engineer                         5800
Business Intelligence Engineer      5200
Name: remote_ratio, dtype: int64

In [22]:
#the high paying remote job

In [43]:
mask=data['remote_ratio']==50
remote_ratio=data[mask]

In [45]:
remote_ratio

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
1,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
2,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
3,2021,MI,FT,ML Engineer,8500000,JPY,77364,JP,50,JP,S
4,2022,SE,FT,Lead Machine Learning Engineer,7500000,INR,95386,IN,50,IN,L
5,2021,MI,FT,ML Engineer,7000000,JPY,63711,JP,50,JP,S
...,...,...,...,...,...,...,...,...,...,...,...
14822,2020,EN,PT,Data Scientist,19000,EUR,21669,IT,50,IT,S
14825,2023,EN,FT,Data Engineer,18000,USD,18000,IN,50,IN,M
14827,2024,EN,FT,Big Data Engineer,17600,USD,17600,MX,50,MX,L
14828,2024,EN,FT,Data Engineer,17598,USD,17598,MX,50,MX,L
14832,2024,EN,PT,Data Science,15000,EUR,16666,DE,50,DE,M

In [46]:
remote_ratio.shape[0]

248

In [48]:
remote_ratio.groupby('job_title')['remote_ratio'].count()

job_title
AI Developer                        4
AI Engineer                         2
AI Product Manager                  1
AI Research Scientist               1
AI Scientist                        4
                                   ..
Research Scientist                 12
Software Data Engineer              1
Staff Data Analyst                  1
Staff Data Scientist                1
Staff Machine Learning Engineer     1
Name: remote_ratio, Length: 71, dtype: int64

In [51]:
data.groupby('job_title')['remote_ratio'].count().sort_values(ascending=False).head(5)

job_title
Data Engineer                3162
Data Scientist               3015
Data Analyst                 2189
Machine Learning Engineer    1542
Research Scientist            475
Name: remote_ratio, dtype: int64

In [52]:
#to find out data scientist high paying loc

In [67]:
ds=data[data['job_title']=='Data Scientist']

In [68]:
ds.groupby('remote_ratio')['salary'].sum().sort_values(ascending=False).head(3)

remote_ratio
0      309555047
100    211989219
50      21319140
Name: salary, dtype: int64

In [75]:
def high_paying(job_title):
    ds=data[data['job_title']==job_title]
    return ds.groupby('remote_ratio')['salary'].sum().sort_values(ascending=False).head(3)
high_paying("Research Scientist")

remote_ratio
0      76532035
100    14361954
50      1318899
Name: salary, dtype: int64

In [76]:
#isin Functuion
# fiind the most

In [141]:
#data scientist who done remote jobs
data[data['salary_in_usd']>30760	]
# data.groupby('job_title')['remote_ratio'].count()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L
1,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
2,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
3,2021,MI,FT,ML Engineer,8500000,JPY,77364,JP,50,JP,S
4,2022,SE,FT,Lead Machine Learning Engineer,7500000,INR,95386,IN,50,IN,L
...,...,...,...,...,...,...,...,...,...,...,...
14764,2023,EN,FT,Data Scientist,26800,GBP,32974,GB,0,GB,M
14765,2023,EN,FT,Data Analyst,26800,GBP,32974,GB,0,GB,M
14766,2023,EN,FT,Data Analyst,26800,GBP,32974,GB,0,GB,M
14771,2024,MI,FT,Data Manager,25742,GBP,32177,ZA,0,ZA,M
14775,2024,SE,FT,Data Scientist,25000,GBP,31250,GB,0,GB,M

In [168]:
data.groupby('job_title')['remote_ratio'].count()

job_title
AI Architect                        28
AI Developer                        19
AI Engineer                        105
AI Product Manager                   3
AI Programmer                        7
                                  ...
Sales Data Analyst                   1
Software Data Engineer               3
Staff Data Analyst                   3
Staff Data Scientist                 2
Staff Machine Learning Engineer      1
Name: remote_ratio, Length: 153, dtype: int64

In [169]:
data.groupby('job_title')['remote_ratio'].count()>30

job_title
AI Architect                       False
AI Developer                       False
AI Engineer                         True
AI Product Manager                 False
AI Programmer                      False
                                   ...
Sales Data Analyst                 False
Software Data Engineer             False
Staff Data Analyst                 False
Staff Data Scientist               False
Staff Machine Learning Engineer    False
Name: remote_ratio, Length: 153, dtype: bool

In [196]:
roles=data.groupby('job_title')['remote_ratio'].count()

In [197]:
roles

job_title
AI Architect                        28
AI Developer                        19
AI Engineer                        105
AI Product Manager                   3
AI Programmer                        7
                                  ...
Sales Data Analyst                   1
Software Data Engineer               3
Staff Data Analyst                   3
Staff Data Scientist                 2
Staff Machine Learning Engineer      1
Name: remote_ratio, Length: 153, dtype: int64

In [199]:
remote_jobs=data.groupby('job_title')['remote_ratio'].sum()

In [206]:
remote_jobs

job_title
AI Architect                        800
AI Developer                        800
AI Engineer                        2500
AI Product Manager                   50
AI Programmer                       300
                                   ...
Sales Data Analyst                    0
Software Data Engineer              250
Staff Data Analyst                  150
Staff Data Scientist                150
Staff Machine Learning Engineer      50
Name: remote_ratio, Length: 153, dtype: int64

In [200]:
results=(remote_jobs/roles)*100

In [201]:
results

job_title
AI Architect                       2857.142857
AI Developer                       4210.526316
AI Engineer                        2380.952381
AI Product Manager                 1666.666667
AI Programmer                      4285.714286
                                      ...
Sales Data Analyst                    0.000000
Software Data Engineer             8333.333333
Staff Data Analyst                 5000.000000
Staff Data Scientist               7500.000000
Staff Machine Learning Engineer    5000.000000
Name: remote_ratio, Length: 153, dtype: float64

In [202]:
high_remote_jobs=results[results>50]

In [203]:
high_remote_jobs

job_title
AI Architect                       2857.142857
AI Developer                       4210.526316
AI Engineer                        2380.952381
AI Product Manager                 1666.666667
AI Programmer                      4285.714286
                                      ...
Research Scientist                 1789.473684
Software Data Engineer             8333.333333
Staff Data Analyst                 5000.000000
Staff Data Scientist               7500.000000
Staff Machine Learning Engineer    5000.000000
Name: remote_ratio, Length: 125, dtype: float64

In [207]:
"---------------------------------------Completed by Sidra Saqlain----------------------------------------------"

'---------------------------------------Completed by Sidra Saqlain----------------------------------------------'